---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeTotalDepth
source: html/b63d871c-3950-e246-d92d-205c61705cbd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeTotalDepth Property

"Total Depth": Total Depth

## Syntax (C#)
```csharp
public static ForgeTypeId StairsSupporttypeTotalDepth { get; }
```